[{"url":"/1112/main/2008/06/at-home-in-the-field/","rows":[15,9,31,7,14.29,46.67,0],"slug":"at-home-in-the-field","content":{"title":"At home in the field","link":"http://www.theguidon.com/1112/main/2008/06/at-home-in-the-field/","date":"2008-06-07T03:02:07","text":"“LIFE WITHOUT baseball is unimaginable,” says Nikko Dizer (MBA), captain of the Blue Batters. Kristine Drilon (III AB IS), captain of the Lady Batters, shares the sentiment. Both captains have had the passion for the sport as long as they can remember.Nikko was born with baseball pulsing through his veins. Following the footsteps of his grandfather and father, the backbones of his passion for the sport, this Blue Batter had found his niche in the diamond at an early age.As early as six years old, he had learned the tricks of the trade. By 11, he was already going places, making a name for himself abroad.Kristine, better known as Krissie, also found fulfillment in the field at an early age. She began taking softball seriously during her fifth grade in Saint Pedro Poveda College and has never looked back since. The numerous awards she has garnered are a testament to the commitment she has poured out in improving her game further.Her stints in the International Little League Association of Manila gave her the perfect springboard to showcase her talents. She has carried the SEA Youth Baseball and Softball team on an MVP-caliber performance, carrying the label of Home Run Derby Queen for three years. All these achievements while being the varsity’s team captain throughout high school.Going PlacesOn one of his international stints, Nikko was sent to Japan. He came back home impressed. “The Japanese take baseball really seriously, they have made it a significant part of their lives,” he recalls.He hopes that the sport he loves would find itself back onto the map of the Philippine mainstream, once a prominent fixture during the period of American colonization. Those were the days when kids and kids at heart would find an open field, a ball, a bat, and a couple of gloves and sweat it out under the heat of the sun.Nikko has also witnessed the growth of the sport in the provinces. Whenever his teams play against their Visayas and Mindanao counterparts, he sees a lot of promise for the development of the sport in the country. “We can match up on a world-class level.”And rightfully so. He has already represented the Asian-Pacific Region in the Senior League World Series, where all the topnotch youth batters came together in competitive spirit.Back home, he is engaged in Baseball Philippines, a new league formed back in April 2007. Currently, Nikko is playing for the Batangas Bulls, primarily composed of Ateneo and UP batters. While the approach of the game is recreational, he still takes every opportunity to hone his craft for the coming UAAP wars.Big CatchAs long as he can remember, Nikko has played the catcher’s role for almost every team he has played for. So when Ateneo recruited him for the team, he knew what they wanted from him and what he would be giving them.“The catcher is the most tiring position,” he says. “I am the one giving signals to my teammates, especially the pitcher. Think of it like an on-field coach.” Despite the high expectations, Nikko likes the added responsibility once he steps in from the dugout.“It feels good to assert myself, to be vocal and to let my teammates know that there is a lot of trust between us,” he adds. In telling them what he wants to happen, and how to execute it, he is able to affect the tempo of play.Krissie also lives for the opportunity to be the team’s catcher. After coming home with the Rookie of the Year plum, she continues to make her presence felt in more ways than one.“I love playing the position, being able to lead the team, positioning my teammates and giving ourselves a better opportunity to win,” she says.For Nikko, the transition from catcher to second base in the coming season is a challenge he is ready to accept. “During my freshman year, I was a follower, but at the same time, I was told to speak my mind. There has to be constant communication to make things work,” he stresses.Krissie also realized early on that much was expected from her. “Our former team captain, Cheska Bautista (AB PoS ’07), sat us down and told us what it was like when we will be in her position. That we would have to prepare ourselves and start setting expectations for our teammates to be better as well,” she says.She also cited discipline as a key element that would carry them to success, and that it will take everyone’s 100% to get the team further from last year’s finish.During game time, both captains let it all out. No pre-game rituals, only warm-ups, and a prayer offering. They acknowledge that there is no room or error in the heat of the game.Stepping up to the plateThe role of team captain has changed the way Nikko deals with his team for the better. In building his character, he has been able to overcome the challenges he experiences when playing. “Both my ankles are always prone to injuries. I have been strengthening it, but it is also important to learn to play through the pain.”And though defeat is a constant adversary, Nikko tries to see the silver lining in it. “Honestly, I don’t like losing, nobody does, but what really matters is that you play and enjoy the game, no matter what the score says.”Krissie has also had her spate of injuries, and though she has been sidelined with a slight MCL tear that kept her in crutches at times during the past year, she has found ways to make her presence continually felt.“My temper has improved and I am becoming more patient with the rookies. I take every chance to see them become more serious and passionate, because that shows when we play.”Both leaders have also made it a point to practice and train harder, leading their respective teams by example, the best way they can. The only way to improve is to understand that baseball is a learning process. “You don’t just get it,” Nikko says. And while he values talent, it is still chemistry that keeps the team together on the road to beat the best, to be the best.Being the true athletes that they are, Nikko and Krissie exemplify the winning spirit that keeps their teammates motivated and looking upward. Their forgettable finishes in last year’s UAAP season are all in the past, and they can look at it with humility, knowing that they will be working their way from the bottom up.For the Lady Batter, her advice to the budding talents is straightforward. “Just work hard and don’t give up.”“UP, UST, Adamson, all these teams are the favorites coming into the UAAP season, but we want to give ourselves a chance and play well,” Nikko says. A final four finish would be the overall measure of their success this year.In the end, baseball has become more than a sport to this Blue Batter. He constantly sees it as a constant stepping stone to succeeding in life outside the diamond. “Never settle with what you have and who you are right now. There is no limit to your potential.”Spoken with the confidence of a true champion.","excerpt":"“LIFE WITHOUT baseball is unimaginable,” says Nikko Dizer (MBA), captain of the Blue Batters. Kristine Drilon (III AB IS), captain...","categories":[4],"featuredMedia":0,"hasFeaturedMedia":false}},{"url":"/1112/main/2008/06/3-dormers-robbed-inside-campus/","rows":[13,7,1,6,0,53.85,0],"slug":"3-dormers-robbed-inside-campus","content":{"title":"3 dormers robbed inside campus","link":"http://www.theguidon.com/1112/main/2008/06/3-dormers-robbed-inside-campus/","date":"2008-06-18T19:35:54","text":"TWO FRESHMEN dormers and a sophomore were robbed of their laptops in the waiting shed in front of Cervini Hall about 8:40 pm Tuesday.John Rovie Abarado (I BS MIS), Sher Antonette Go (I BS CTM) and Criselle Ann Santiago (II AB Comm) were surfing the internet in the waiting shed when a man approached them and took their laptops. The man also took Abarado’s cellphone.The man fled in a getaway car parked near the waiting shed. The three dormers ran and immediately alerted the guard in Cervini after the incident, but the robbers got away.“Decent-looking”Abarado was visiting the NBA website on his two-week old laptop when the robbery occurred.“May dark green na car na nag-park in front of the waiting shed (There was a dark green car that parked in front of the waiting shed),” he said. A man alighted from the car, which drove away to the direction of the Ateneo High School, Abarado said.A Security Office report described the man as about 5’8” tall, twenty-four years old, fair-skinned, muscular, and decent-looking.Abarado said the man lingered around the waiting shed area for about 15 to 20 minutes. When the dark green car returned, the man pounced on the three dormers.\"Bigla siyang sumugod sa akin, tapos binatukan ako (He suddenly attacked me, then hit me on the back of the neck),” Abarado said. “Sabi niya, hold-up ‘to, huwag kayong sumigaw, kung hindi masasaktan kayo (He said that this is a hold-up, don’t shout, or else you’ll get hurt).”The robber then got the three dormers’ laptops, plus Abarado’s cellphone. Security officers blocked all exit points right after the victims alerted the Cervini guard, but the robbers were not caught.No internet“If there was internet sa (in the) dorm, I wouldn’t have gone outside,” said Go, who was checking for prices of flight tickets to Cebu during the incident.There was no Wi-Fi internet access in the dorm last Tuesday because of the ongoing construction, said Residence Halls Director Timothy Gabuna.Gabuna said that the parents of the victims couldn’t believe what happened. “Nakakahiya sa parents (It is very embarrassing, especially to the parents),” he said.This was the first time in years that a robbery incident happened inside campus, said University Physical Plant Administrator Leoncio Miralao.VigilanceBecause of limited information on the incident, Miralao said he is not optimistic that the robbers will be caught.Campus Security Head Sgs. Avelino Guzilan said, however, that University security officers would be more vigilant of cars going in and out the campus. Security guards will also stay until 10 pm, an hour longer than the usual 9 pm, to ensure better campus security.Miralao also urged students to be more vigilant. He added, “Security will be more effective with the cooperation of the community, with everybody helping out.”","excerpt":"TWO FRESHMEN dormers and a sophomore were robbed of their laptops in the waiting shed in front of Cervini Hall...","categories":[3],"featuredMedia":0,"hasFeaturedMedia":false}},{"url":"/1112/main/2008/06/ateneo-holds-table-tennis-seminar/","rows":[19,8,50,5,0,36.84,0],"slug":"ateneo-holds-table-tennis-seminar","content":{"title":"Ateneo holds table tennis seminar","link":"http://www.theguidon.com/1112/main/2008/06/ateneo-holds-table-tennis-seminar/","date":"2008-06-07T03:06:29","text":"LAST May 30 and June 1, a seminar on “New Trends in Teaching Table Tennis for PE Teachers” was held at the Blue Eagle Gym.This seminar, aimed to standardize the curriculum of table tennis throughout the country, involved PE and varsity coaches from various schools. It was organized by the Table Tennis Association of the Philippines in coordination with the University Athletics Office of Ateneo.The seminar was created because of unawareness of the implementation of the rules and teaching methods in the world of table tennis throughout, even at competitive levels. The program looked for trends abroad that can be adapted by the participants.“We teach them the basic fundamentals and laws of the sport and brief them on the situation of the curriculum of the sport as shown by the DepEd (Department of Education)”, explained Oscar Yoshihiro S. Santelices, an organizer of the event and member of the UP Diliman Human Kinetics Department.He added that this is the first in the series of seminars that will eventually spread to the different provinces in order to improve the state of table tennis in the country. ‘I even asked the DepEd to make table tennis part of the curriculum,” said Santelices.Ateneo’s involvement comes as the Blue Paddler’s nest at the Blue Eagle Gym has now been renovated and now a top-class table tennis facility. This was a result of this proposal to use it as a National Training Center.“Soon this will be launched as the National Training Center, and the first step is this seminar to stabilize teaching table tennis in the country,” said 6-year Blue Paddler’s Coach Floyd Lobaton. Lobaton is also one of the major players in this innovative movement.Many departments of the school were involved in this event including some of the Blue Paddlers themselves.","excerpt":"LAST May 30 and June 1, a seminar on “New Trends in Teaching Table Tennis for PE Teachers” was held...","categories":[4],"featuredMedia":0,"hasFeaturedMedia":false}},{"url":"/1112/main/2008/06/battle-tested-and-busting-out/","rows":[9,5,2,5,0,55.56,0],"slug":"battle-tested-and-busting-out","content":{"title":"Battle-tested and busting out","link":"http://www.theguidon.com/1112/main/2008/06/battle-tested-and-busting-out/","date":"2008-06-07T03:05:13","text":"BEING IN Team B entails as much sacrifice, will, and commitment as a varsity member, but with half the perks. There is as much pressure to conquer, less fame to take pride in, and less fruits to reap. Yet in the midst of obscurity, there are still those who make a name for themselves once they go out and give their all for the school’s name.Head Above WaterOne cannot deny the fact that Hans Clifton Ang (III BS ME) is meant to be in the water.Having learned to swim at age one, his skills were honed constantly from then on – allowing him to compete in swimming competitions by age six. Despite giving up the sport when he entered formal schooling, he was still able to make the varsity team in Grade 4 and stay with them through his high school days. And although he stopped on several occasions, he always found his way back to the gleaming blue waters of the pool.Hans says that, as a Blue Tanker, he is eager to compete in the UAAP, and finds nothing wrong with being in Team B. In fact, he relates that the only major difference between being in Team A and Team B is the type of workouts that they do.However, he admitted that there are times when it becomes difficult not being on the UAAP line-up. “There are those people who constantly tease me that I am just in Team B; [that] I don't really represent the school.”After spending a year on the training team, however, Hans relates, “being on Team B serves as a reminder and inspiration that I have to train harder to get into Team A; that our main role on the team is to improve and hopefully contribute come the following UAAP season.”Asked what he thinks is necessary to stand out amidst the Tankers’ deep pool of talent, he points out three necessary values: “hard work, dedication and passion.”A Paddler’s High TossIt was nothing Trechelle Lyn Ras (III BS LM) expected. After giving a preview of her skills throughout her second semester Physical Education class, she was given the opportunity to try out for the table tennis varsity for membership to the Ateneo Lady Paddlers.“It was a whole new world for me,” Trechelle says, who had no prior varsity experience. She recalls her first tryout and how her coach instilled the idea that it takes true commitment in order to make the squad.Having to compete with other players for limited slots, she considered the amount of effort to retain her membership a daunting task. The Lady Paddler constantly dealt with several challenges during her time on the training team. She was always in the bubble, sacrificing time at home to attend her training schedule, which ate up a significant chunk of her evenings.She describes the challenge of dealing with self-doubt and coping with the high level of play among the varsity members. “There were times [when] I would be in bed and think if I would train today”, says Trechelle on her struggle with training.But her zeal paid off. She was the only trainee to remain with the team as her game gradually improved. Trechelle also began to have success on the court in various tournaments and opens.She attributes her success to the teammates who helped her every step of the way. “Meeting new friends was helpful in dealing with my insecurities,” says the Lady Paddler of her teammates.Looking back, she never expected to be where she is right now, one of the varsity’s newest members. Although she will not compete in this year’s UAAP due to her Junior Term Abroad, she is certain that she will be back smashing and serving upon her return.As one of Ateneo’s unsung heroes, Trechelle describes her experience as “not being about jerseys and benefits but rather about commitment.”Sibling RevelryHe shares a room and surname with sibling Chris Tiu, but this guy’s star shines on its own. Charles Justin Tiu (III BS Mgt), as a member of the Men’s Basketball Team B, is a player worth taking pride in. At 5’10”, it’s definitely hard to miss Charles in campus. In fact, just like his brother, he has won himself fans.Charles started playing basketball when most of us still had milk teeth. He has already represented the school in various tourneys such as the Father Martin’s Cup, Home and Away League, and Fil-Oil Flying V Cup. Although he doesn’t play in the big leagues, he says that “just wearing that uniform that says Ateneo already means a lot. It's always a great honor to represent your team, and you get recognized when your team plays well.”Even if basketball is important to him, studying is still first priority. Because he is leaving for Austria this September for his Junior Term Abroad, he won’t be seen on the hardcourt this season. “It's actually tough because I've always dreamed of playing for the UAAP team and to be teammates with my brother also. But I think there are more things to life than just basketball,” he confesses.Being the King Eagle’s younger brother isn’t a bed of roses. Comparison is inevitable but Charles says that he’s mature enough to handle these issues. He explains, “People often tell me that I shouldn't be following his footsteps, I should make a name for myself but I see his life and how successful he's been, why not follow the way he does things?”","excerpt":"BEING IN Team B entails as much sacrifice, will, and commitment as a varsity member, but with half the perks....","categories":[4],"featuredMedia":0,"hasFeaturedMedia":false}}]